In [8]:
!pip install mysql-connector-python pandas

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.5.0-cp312-cp312-win_amd64.whl.metadata (7.7 kB)
Requirement already satisfied: pandas in c:\users\pierr\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\pierr\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pierr\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\pierr\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\pierr\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\pierr\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading mysql_connector_python-9.5.0-cp312-cp312-win_amd64.whl (16.5 MB)
   ---------------------------------------- 0.0/16.5 MB ? eta -:--:--
   --------- ------------------------------ 3.9/16.5 MB 21.3 MB/s eta 0:00:01
   ----------------------- ---------------- 9.7/16.5 MB 24.1 MB/s eta 0:00:01
   -------------------------------------- - 15.7/16.5 MB 25.4 MB/s eta 0:00:01
   ---------------------------------------- 16.5/16.5 MB 22.1 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.5.0

In [ ]:
import mysql.connector
import pandas as pd

# Connexion à la base
conn = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="",  # Ton mot de passe si besoin !
    database="chinook"
)

# Exemple pour afficher 10 premières entrées de Artist
df_artist = pd.read_sql("SELECT * FROM Artist LIMIT 10", conn)
display(df_artist)

# Pour Album
df_album = pd.read_sql("SELECT * FROM Album LIMIT 10", conn)
display(df_album)

# Pour Track
df_track = pd.read_sql("SELECT * FROM Track LIMIT 10", conn)
display(df_track)

# Pour Playlist
df_playlist = pd.read_sql("SELECT * FROM Playlist LIMIT 10", conn)
display(df_playlist)

# Pour une association PlaylistTrack (pour voir les liens)
df_playlisttrack = pd.read_sql("SELECT * FROM PlaylistTrack LIMIT 10", conn)
display(df_playlisttrack)

conn.close()

C:\Users\pierr\AppData\Local\Temp\ipykernel_8820\868200229.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_artist = pd.read_sql("SELECT * FROM Artist LIMIT 10", conn)

   ArtistId                Name
0         1         The Beatles
1         2        Led Zeppelin
2         3          Pink Floyd
3         4               Queen
4         5  The Rolling Stones
5         6               AC/DC
6         7           Metallica
7         8             Nirvana
8         9           Radiohead
9        10            Coldplay

C:\Users\pierr\AppData\Local\Temp\ipykernel_8820\868200229.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_album = pd.read_sql("SELECT * FROM Album LIMIT 10", conn)

   AlbumId                      Title  ArtistId
0        1                 Abbey Road         1
1        2                  Let It Be         1
2        3            Led Zeppelin IV         2
3        4          Physical Graffiti         2
4        5  The Dark Side of the Moon         3
5        6         Wish You Were Here         3
6        7       A Night at the Opera         4
7        8          News of the World         4
8        9             Sticky Fingers         5
9       10          Exile on Main St.         5

C:\Users\pierr\AppData\Local\Temp\ipykernel_8820\868200229.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_track = pd.read_sql("SELECT * FROM Track LIMIT 10", conn)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,Come Together,1,1,1,None,259000,None,1.29
1,2,Something,1,2,1,None,233000,None,1.19
2,3,Dear Prudence,2,1,1,None,230000,None,1.09
3,4,Norwegian Wood,3,3,2,None,207000,None,1.39
4,5,Blackbird,4,1,2,None,206000,None,1.29
5,6,While My Guitar Gently Weeps,5,2,3,None,320000,None,1.29
6,7,Strawberry Fields Forever,6,3,1,None,246000,None,1.49
7,8,Penny Lane,7,1,4,None,228000,None,1.09
8,9,Revolution,8,1,5,None,277000,None,1.19
9,10,Lady Madonna,9,2,5,None,204000,None,1.29

C:\Users\pierr\AppData\Local\Temp\ipykernel_8820\868200229.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_playlist = pd.read_sql("SELECT * FROM Playlist LIMIT 10", conn)

   PlaylistId                Name
0           1       Rock Classics
1           2           80s Metal
2           3    British Invasion
3           4   Grunge Essentials
4           5  Pink Floyd Journey
5           6     Queen Anthology
6           7        Beatles Best
7           8   Zeppelin Classics
8           9  Nirvana Collection
9          10     Modern Classics

C:\Users\pierr\AppData\Local\Temp\ipykernel_8820\868200229.py:29: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_playlisttrack = pd.read_sql("SELECT * FROM PlaylistTrack LIMIT 10", conn)

   PlaylistId  TrackId
0           1        1
1           1        2
2           2        2
3           1        3
4           2        3
5           3        3
6           1        4
7           2        4
8           3        4
9           4        4